In [1]:
x=10

In [4]:
print(x)

10

In [6]:
x=11
y=12

In [9]:
print(x)
print(y)

11
12

In [11]:
import pandas as pd

In [13]:
data1 = pd.read_excel(r'C:\Users\hp\Desktop\MyRawData1.xlsx')

In [15]:
data1

       Name   Age   Salary
0     Gaurav    30   55500
1      Rohit    37   75000
2   Joginder    41   81000
3     Mahesh    39   91000
4     Riecha    44  103750
5    Pallavi    47  115000
6      Neelu    50  126250
7  Shivendra    53  137500
8      Aarti    56  148750
9       Alka    60  160000

In [21]:
data2 = pd.read_csv(r'C:\Users\hp\Desktop\MYRawdata2.csv')

In [22]:
data2

   Roll Number      Name  Batch
0          1001    Akash   1840
1          1003   Deepak   1843
2          1005    Kasia   1842
3          1130   Andrea   1857
4          1132  Deepika   1876
5          1170    Geert   1877
6          1209    David   1886
7          1248    Susan   1894
8          1823     Anuj   1876
9          1237   Keshav   1878

In [28]:
data3 = pd.read_csv(r'C:\Users\hp\Desktop\MyRawdata3.tsv',sep='\t')

In [29]:
data3

   RollNo    Name  Batch
0    1234   Rahim   1845
1    1235     Ali   1876
2    1254  Faizan   1876
3    1238  Rakesh   1897
4    1265  Sohaib   1876